[
  {
    "id": 1,
    "image": "https://i.ibb.co/1gyzBgx/2920269.png",
    "title": "SnapShot Pro",
    "companyName": "PixelCraft",
    "description": "SnapShot Pro is an advanced focus-driven photo editing app that transforms how you create visual content. Instead of merely applying filters, it provides a complete workspace where every edit is intentional, helping you achieve professional results while minimizing distractions. Users can organize projects, apply AI-powered enhancements, and manage multiple layers efficiently. The minimal design keeps the interface clean and calming, ensuring your creativity flows without interruption. Notifications guide you gently when actions are completed, promoting a steady workflow and a satisfying creative experience.",
    "size": 45,
    "reviews": "12K",
    "ratingAvg": 4.6,
    "downloads": "850K",
    "ratings": [
      {
        "name": "5 star",
        "count": 9100
      },
      {
        "name": "4 star",
        "count": 2000
      },
      {
        "name": "3 star",
        "count": 500
      },
      {
        "name": "2 star",
        "count": 240
      },
      {
        "name": "1 star",
        "count": 150
      }
    ]
  },
  {
    "id": 2,
    "image": "https://i.ibb.co/YBft1gzf/2966486.png",
    "title": "FitLife Tracker",
    "companyName": "WellnessWare",
    "description": "FitLife Tracker combines modern fitness tracking with focus-based routines to optimize your health. Rather than just logging steps or workouts, it creates a structured environment where users can follow personalized intervals, monitor heart rate trends, and receive timely nudges to stay active. The interface is clean and motivating, designed to reduce overwhelm and help you concentrate on your wellness goals. Daily summaries and smart notifications ensure you can maintain a balanced rhythm between activity and rest.",
    "size": 52,
    "reviews": "8.7K",
    "ratingAvg": 4.8,
    "downloads": "640K",
    "ratings": [
      {
        "name": "5 star",
        "count": 6500
      },
      {
        "name": "4 star",
        "count": 1700
      },
      {
        "name": "3 star",
        "count": 300
      },
      {
        "name": "2 star",
        "count": 150
      },
      {
        "name": "1 star",
        "count": 80
      }
    ]
  },
  {
    "id": 3,
    "image": "https://i.ibb.co/ZQzwCDD/727245.png",
    "title": "TuneBox",
    "companyName": "MelodyWorks",
    "description": "TuneBox is a music companion that turns listening into a focused experience. Beyond streaming, it creates an immersive environment for discovering songs, curating playlists, and exploring AI-driven recommendations. The app encourages mindful listening by minimizing distractions and offering detailed insights on your listening habits. The interface is clean and adaptive, promoting an uninterrupted connection with your music while maintaining a sense of order and clarity. Real-time suggestions guide you gently, helping you stay in flow without missing a beat.",
    "size": 38,
    "reviews": "15.2K",
    "ratingAvg": 4.7,
    "downloads": "910K",
    "ratings": [
      {
        "name": "5 star",
        "count": 11520
      },
      {
        "name": "4 star",
        "count": 2400
      },
      {
        "name": "3 star",
        "count": 800
      },
      {
        "name": "2 star",
        "count": 280
      },
      {
        "name": "1 star",
        "count": 200
      }
    ]
  },
  {
    "id": 4,
    "image": "https://i.ibb.co/gLCykhJw/1161388.png",
    "title": "TaskFlow",
    "companyName": "ProdigySoft",
    "description": "TaskFlow transforms productivity by creating a focused environment for task management. Instead of just listing to-dos, it structures daily tasks, projects, and reminders into an organized workflow. Users can set priorities, track progress, and receive gentle notifications to maintain momentum. The interface is minimal and calming, allowing you to concentrate on completing tasks efficiently. Insights and statistics provide clarity on performance, helping you establish a sustainable rhythm between work and breaks.",
    "size": 29,
    "reviews": "6.4K",
    "ratingAvg": 4.5,
    "downloads": "300K",
    "ratings": [
      {
        "name": "5 star",
        "count": 4340
      },
      {
        "name": "4 star",
        "count": 1400
      },
      {
        "name": "3 star",
        "count": 450
      },
      {
        "name": "2 star",
        "count": 120
      },
      {
        "name": "1 star",
        "count": 90
      }
    ]
  },
  {
    "id": 5,
    "image": "https://i.ibb.co/60xJVgxD/891462.png",
    "title": "ShopEase",
    "companyName": "BuySmart",
    "description": "ShopEase turns online shopping into a calm, focused experience. It does more than just display products—it creates a structured environment for browsing, comparing, and purchasing efficiently. Smart filters, curated deals, and gentle notifications guide users without overwhelming them. The interface reduces clutter, allowing shoppers to concentrate on finding exactly what they need. Analytics and order tracking ensure you remain informed, creating a seamless rhythm between browsing and checkout.",
    "size": 70,
    "reviews": "19.5K",
    "ratingAvg": 4.9,
    "downloads": "999K",
    "ratings": [
      {
        "name": "5 star",
        "count": 14200
      },
      {
        "name": "4 star",
        "count": 3500
      },
      {
        "name": "3 star",
        "count": 950
      },
      {
        "name": "2 star",
        "count": 420
      },
      {
        "name": "1 star",
        "count": 310
      }
    ]
  },
  {
    "id": 6,
    "image": "https://i.ibb.co/HLvM7vqp/2343752.png",
    "title": "MindSpace",
    "companyName": "ZenLabs",
    "description": "MindSpace is a mindfulness and meditation app that structures your mental wellness into focused sessions. Instead of generic exercises, it builds an environment where each session guides you step by step, helping reduce stress and enhance concentration. Gentle reminders encourage consistency without disruption, and detailed mood tracking provides insights over time. The clean interface keeps distractions away, fostering a serene experience that promotes deep relaxation and self-awareness.",
    "size": 44,
    "reviews": "10.5K",
    "ratingAvg": 4.7,
    "downloads": "750K",
    "ratings": [
      {
        "name": "5 star",
        "count": 7690
      },
      {
        "name": "4 star",
        "count": 1800
      },
      {
        "name": "3 star",
        "count": 650
      },
      {
        "name": "2 star",
        "count": 200
      },
      {
        "name": "1 star",
        "count": 160
      }
    ]
  },
  {
    "id": 7,
    "image": "https://i.ibb.co/yFQQftjx/3570091.png",
    "title": "TravelGo",
    "companyName": "TripEase",
    "description": "TravelGo makes planning trips a structured and stress-free experience. Users can explore destinations, book hotels and flights, and manage itineraries in a calm, guided workflow. The app provides timely suggestions and notifications without overwhelming, allowing travelers to focus on each decision step. Minimal design and intuitive navigation ensure a smooth journey from planning to execution, fostering a steady rhythm of exploration and relaxation.",
    "size": 61,
    "reviews": "8.9K",
    "ratingAvg": 4.6,
    "downloads": "540K",
    "ratings": [
      {
        "name": "5 star",
        "count": 6320
      },
      {
        "name": "4 star",
        "count": 1800
      },
      {
        "name": "3 star",
        "count": 430
      },
      {
        "name": "2 star",
        "count": 220
      },
      {
        "name": "1 star",
        "count": 130
      }
    ]
  },
  {
    "id": 8,
    "image": "https://i.ibb.co/Qv6XvZPd/552721.png",
    "title": "NoteMate",
    "companyName": "SmartInk",
    "description": "NoteMate structures note-taking into a focused and productive habit. Beyond just writing, it organizes ideas, projects, and reminders into a calm interface that minimizes distractions. Users can tag notes, sync across devices, and set subtle notifications to stay on track. Daily summaries and smart suggestions keep workflow organized, helping maintain a balanced rhythm between creating, reviewing, and archiving notes.",
    "size": 28,
    "reviews": "7.2K",
    "ratingAvg": 4.5,
    "downloads": "480K",
    "ratings": [
      {
        "name": "5 star",
        "count": 4930
      },
      {
        "name": "4 star",
        "count": 1600
      },
      {
        "name": "3 star",
        "count": 420
      },
      {
        "name": "2 star",
        "count": 150
      },
      {
        "name": "1 star",
        "count": 100
      }
    ]
  },
  {
    "id": 9,
    "image": "https://i.ibb.co/S2LKGHC/846449.png",
    "title": "EduPlus",
    "companyName": "LearnWise",
    "description": "EduPlus converts learning into a focused, structured experience. Instead of passively consuming content, users engage with interactive lessons, quizzes, and video lectures in timed sessions designed to maximize retention. The interface is minimal, reducing cognitive load, while smart reminders encourage consistent study habits. Progress tracking and performance analytics guide learners in a calm, step-by-step workflow that reinforces deep understanding and long-term mastery.",
    "size": 65,
    "reviews": "11.2K",
    "ratingAvg": 4.8,
    "downloads": "990K",
    "ratings": [
      {
        "name": "5 star",
        "count": 7760
      },
      {
        "name": "4 star",
        "count": 2500
      },
      {
        "name": "3 star",
        "count": 600
      },
      {
        "name": "2 star",
        "count": 200
      },
      {
        "name": "1 star",
        "count": 140
      }
    ]
  },
  {
    "id": 10,
    "image": "https://i.ibb.co/939gCFwk/483947.png",
    "title": "Newsify",
    "companyName": "InfoStream",
    "description": "Newsify structures news consumption into calm, focused sessions. Instead of overwhelming users with constant updates, it organizes articles, breaking news, and trending stories into digestible intervals. Smart notifications provide important alerts while maintaining a balanced pace. The interface is minimal and clean, helping users absorb information efficiently and avoid distraction fatigue. Insights and personalization features ensure a steady, thoughtful news reading habit.",
    "size": 48,
    "reviews": "9.6K",
    "ratingAvg": 4.4,
    "downloads": "780K",
    "ratings": [
      {
        "name": "5 star",
        "count": 6550
      },
      {
        "name": "4 star",
        "count": 1900
      },
      {
        "name": "3 star",
        "count": 700
      },
      {
        "name": "2 star",
        "count": 260
      },
      {
        "name": "1 star",
        "count": 190
      }
    ]
  },
  {
    "id": 11,
    "image": "https://i.ibb.co/4wh6tCgF/1661623.png",
    "title": "CookBook Master",
    "companyName": "FoodNest",
    "description": "CookBook Master transforms cooking into a focused, creative experience. Recipes are presented in step-by-step guided sessions, reducing distraction while cooking. Users can track ingredients, create grocery lists, and set reminders for each step. The interface is clean and intuitive, helping maintain a calm and enjoyable rhythm in the kitchen. Nutritional insights and meal planning tips further enhance the mindful cooking workflow.",
    "size": 57,
    "reviews": "6.7K",
    "ratingAvg": 4.7,
    "downloads": "530K",
    "ratings": [
      {
        "name": "5 star",
        "count": 4190
      },
      {
        "name": "4 star",
        "count": 1700
      },
      {
        "name": "3 star",
        "count": 500
      },
      {
        "name": "2 star",
        "count": 200
      },
      {
        "name": "1 star",
        "count": 110
      }
    ]
  },
  {
    "id": 12,
    "image": "https://i.ibb.co/cXKqm2k3/3063196.png",
    "title": "GameZone",
    "companyName": "PlayLabs",
    "description": "GameZone structures gaming into a focused and social experience. Beyond just playing, it offers guided sessions, live scores, community interactions, and leaderboard tracking in a calm interface. Notifications and suggestions are timed to maintain flow without overwhelming users. The minimal design allows players to concentrate on gameplay, community engagement, and skill improvement, creating an immersive and uninterrupted gaming rhythm.",
    "size": 72,
    "reviews": "15.6K",
    "ratingAvg": 4.9,
    "downloads": "988k",
    "ratings": [
      {
        "name": "5 star",
        "count": 12600
      },
      {
        "name": "4 star",
        "count": 3500
      },
      {
        "name": "3 star",
        "count": 800
      },
      {
        "name": "2 star",
        "count": 400
      },
      {
        "name": "1 star",
        "count": 300
      }
    ]
  },
  {
    "id": 13,
    "image": "https://i.ibb.co/xtVnFfWK/1067566.png",
    "title": "Weatherly",
    "companyName": "SkyWatch",
    "description": "Weatherly structures weather updates into calm, predictable intervals. It delivers forecasts, radar maps, and alerts in a focused interface, allowing users to absorb information without distraction. Timed notifications and clean visualization help maintain a steady workflow when planning activities, ensuring users stay informed while minimizing stress and overload. The interface is minimal and soothing, promoting clarity and calmness in daily weather planning.",
    "size": 46,
    "reviews": "8.3K",
    "ratingAvg": 4.5,
    "downloads": "670K",
    "ratings": [
      {
        "name": "5 star",
        "count": 5790
      },
      {
        "name": "4 star",
        "count": 1600
      },
      {
        "name": "3 star",
        "count": 500
      },
      {
        "name": "2 star",
        "count": 240
      },
      {
        "name": "1 star",
        "count": 170
      }
    ]
  },
  {
    "id": 14,
    "image": "https://i.ibb.co/Y4JHPyzc/942751.png",
    "title": "FinanceHub",
    "companyName": "MoneyWise",
    "description": "FinanceHub structures your financial management into calm, focused sessions. Users can track expenses, monitor savings, and plan budgets in a distraction-free interface. Timed insights and notifications help maintain a steady workflow, allowing users to focus on making informed decisions. The minimal design reduces stress and supports long-term financial planning, creating a clear, mindful money management routine.",
    "size": 50,
    "reviews": "9.1K",
    "ratingAvg": 4.6,
    "downloads": "620K",
    "ratings": [
      {
        "name": "5 star",
        "count": 6500
      },
      {
        "name": "4 star",
        "count": 1800
      },
      {
        "name": "3 star",
        "count": 460
      },
      {
        "name": "2 star",
        "count": 210
      },
      {
        "name": "1 star",
        "count": 130
      }
    ]
  },
  {
    "id": 15,
    "image": "https://i.ibb.co/Mk4ppJ79/709722.png",
    "title": "BookNest",
    "companyName": "Readify",
    "description": "BookNest converts reading into structured, mindful sessions. Beyond eBooks and audiobooks, it guides users through curated reading plans with calm notifications and progress tracking. The interface is minimal, reducing distractions and allowing focus on content. Personalized recommendations and detailed reading statistics foster an uninterrupted rhythm of learning and enjoyment, helping users build a steady, satisfying reading habit.",
    "size": 59,
    "reviews": "8.4K",
    "ratingAvg": 4.7,
    "downloads": "560K",
    "ratings": [
      {
        "name": "5 star",
        "count": 5790
      },
      {
        "name": "4 star",
        "count": 1800
      },
      {
        "name": "3 star",
        "count": 500
      },
      {
        "name": "2 star",
        "count": 190
      },
      {
        "name": "1 star",
        "count": 120
      }
    ]
  },
  {
    "id": 16,
    "image": "https://i.ibb.co/Z66X1vRC/1086933.png",
    "title": "DriveSync",
    "companyName": "AutoTech",
    "description": "DriveSync transforms vehicle data into focused, actionable insights. Users can track mileage, fuel efficiency, and driving behavior in structured sessions, minimizing distraction while driving. The interface is minimal and clear, offering real-time analytics and trip reports without overwhelming. Notifications are subtle, promoting steady attention to driving habits and maintenance schedules, ensuring a safe, informed, and efficient driving experience.",
    "size": 54,
    "reviews": "7.8K",
    "ratingAvg": 4.6,
    "downloads": "490K",
    "ratings": [
      {
        "name": "5 star",
        "count": 5470
      },
      {
        "name": "4 star",
        "count": 1600
      },
      {
        "name": "3 star",
        "count": 400
      },
      {
        "name": "2 star",
        "count": 180
      },
      {
        "name": "1 star",
        "count": 150
      }
    ]
  },
  {
    "id": 17,
    "image": "https://i.ibb.co/cS8Cwvy2/1998732.png",
    "title": "LanguageLink",
    "companyName": "PolyglotTech",
    "description": "LanguageLink structures language learning into calm, focused sessions. It combines interactive lessons, flashcards, and pronunciation feedback in a distraction-free interface. Smart notifications encourage consistent study habits, while progress tracking helps maintain motivation. The minimal, clean design allows users to concentrate on mastering vocabulary, grammar, and conversational skills steadily, fostering deep understanding and fluency over time.",
    "size": 66,
    "reviews": "9.7K",
    "ratingAvg": 4.8,
    "downloads": "710K",
    "ratings": [
      {
        "name": "5 star",
        "count": 7140
      },
      {
        "name": "4 star",
        "count": 1800
      },
      {
        "name": "3 star",
        "count": 430
      },
      {
        "name": "2 star",
        "count": 190
      },
      {
        "name": "1 star",
        "count": 140
      }
    ]
  },
  {
    "id": 18,
    "image": "https://i.ibb.co/KcwPj48q/3602123.png",
    "title": "Artify",
    "companyName": "CreativeHub",
    "description": "Artify transforms digital art creation into a calm, focused experience. Users can draw, layer, and edit artwork in structured sessions, minimizing distractions. The interface is clean and intuitive, guiding artists through projects efficiently. Notifications and workflow suggestions help maintain rhythm, promoting creativity while avoiding interruption. Cloud sync ensures seamless progress across devices, fostering uninterrupted artistic flow.",
    "size": 62,
    "reviews": "8.8K",
    "ratingAvg": 4.7,
    "downloads": "660K",
    "ratings": [
      {
        "name": "5 star",
        "count": 6310
      },
      {
        "name": "4 star",
        "count": 1700
      },
      {
        "name": "3 star",
        "count": 470
      },
      {
        "name": "2 star",
        "count": 200
      },
      {
        "name": "1 star",
        "count": 120
      }
    ]
  },
  {
    "id": 19,
    "image": "https://i.ibb.co/vC2jyVF4/1046784.png",
    "title": "HealthMate",
    "companyName": "CareSync",
    "description": "HealthMate structures personal health monitoring into focused, distraction-free sessions. Users can track medical data, prescriptions, and consultations calmly. Gentle notifications guide daily wellness habits, while clear visualizations promote understanding and proactive care. The minimal interface supports uninterrupted focus, helping users stay informed, follow routines, and maintain a steady rhythm in health management.",
    "size": 49,
    "reviews": "9.2K",
    "ratingAvg": 4.8,
    "downloads": "720K",
    "ratings": [
      {
        "name": "5 star",
        "count": 6730
      },
      {
        "name": "4 star",
        "count": 1700
      },
      {
        "name": "3 star",
        "count": 460
      },
      {
        "name": "2 star",
        "count": 180
      },
      {
        "name": "1 star",
        "count": 130
      }
    ]
  },
  {
    "id": 20,
    "image": "https://i.ibb.co/5gJZFwCy/3659899.png",
    "title": "ChatBuddy",
    "companyName": "TalkFlow",
    "description": "ChatBuddy organizes conversations into focused, distraction-free sessions. Users can talk naturally, translate messages instantly, and receive smart suggestions in real time. Voice, text, and group chats are managed in a calm, minimal interface. Notifications are gentle, guiding users to maintain a smooth rhythm in communication. Cloud sync ensures all conversations remain accessible without interruption, fostering seamless and efficient chat management.",
    "size": 60,
    "reviews": "9.5K",
    "ratingAvg": 4.8,
    "downloads": "920K",
    "ratings": [
      {
        "name": "5 star",
        "count": 6780
      },
      {
        "name": "4 star",
        "count": 1600
      },
      {
        "name": "3 star",
        "count": 600
      },
      {
        "name": "2 star",
        "count": 300
      },
      {
        "name": "1 star",
        "count": 220
      }
    ]
  }
]